mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *P1SEL>
    struct PortSel0and1 {

      private:
        MT::Universal::Register<INREG>   m_in{};
        MT::Universal::Register<OUTREG>  m_out{};
        MT::Universal::Register<DIRREG>  m_dir{};
        MT::Universal::Register<PRENREG> m_pull{};
        MT::Universal::Register<P0SEL>   m_p0sel{};
        MT::Universal::Register<P1SEL>   m_p1sel{};

      public:
        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets the given Pins as a output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsOutputPin(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsOutputPin(const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.set(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets the given Pins as a input
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsInputPin(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsInputPin(const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.clear(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets for the given Pins the module function as a output -> check device datasheet
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsPeripheralModuleFunctionOutputPin(GPIO::MODULE_FUNC::PRIMARY, GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@param func the function for the pin  (GPIO::MODULE_FUNC)
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsPeripheralModuleFunctionOutputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            m_dir.set(bit);

            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    m_p1sel.set(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    m_p1sel.set(bit);
                    break;
                default:
                    break;
            }
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets for the given Pins the module function as a input -> check device datasheet
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsPeripheralModuleFunctionInputPin(GPIO::MODULE_FUNC::PRIMARY, GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@param func the function for the pin  (GPIO::MODULE_FUNC)
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsPeripheralModuleFunctionInputPin(const MODULE_FUNC func, const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
            m_dir.clear(bit);
            switch (func) {
                case MODULE_FUNC::GPIO:
                    m_p0sel.clear(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::PRIMARY:
                    m_p0sel.set(bit);
                    m_p1sel.clear(bit);
                    break;
                case MODULE_FUNC::SECONDARY:
                    m_p0sel.clear(bit);
                    m_p1sel.set(bit);
                    break;
                case MODULE_FUNC::TERNARY:
                    m_p0sel.set(bit);
                    m_p1sel.set(bit);
                    break;
                default:
                    break;
            }
        }


        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief set the given Pins as a input with Pulldown enabled
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsInputPinWithPullDown(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsInputPinWithPullDown(const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.clear(bit);
        }

        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief set the given Pins as a input with Pullup enabled
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setAsInputPinWithPullUp(GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setAsInputPinWithPullUp(const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");
#ifdef MT_MSP430_USE_DRIVERLIB_COMPATIBILITY
            m_p0sel.clear(bit);
            m_p1sel.clear(bit);
#endif
            m_dir.clear(bit);
            m_pull.set(bit);
            m_out.set(bit);
        }
    };

