mrnoise/MicroTrait/MSP430/GPIO/Gpio.hpp
    template<volatile auto *DRVREG>
    struct PortWithDrv {

      private:
        MT::Universal::Register<DRVREG> m_drv{};

      public:
#if defined(__MSP430F5XX_6XX_FAMILY__)
        /**
		* @ingroup groupFuncsMSP430Gpio
		****************************************************************
		* @brief sets the drive strength for the selected port pin  -> only available for MSP430F5xx/6xx Family
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  GPIO::Port1 p1{};
		*  p1.setDriveStrength(GPIO::DRV_STRENGTH::REDUCED, GPIO::PIN::P0 | GPIO::PIN::P1); \endcode
		*@tparam BIT use enumeration GPIO::PIN
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type>
        constexpr void setDriveStrength(const DRV_STRENGTH drv, const BIT &bit) noexcept {
            static_assert(std::is_same<MT::MSP430::GPIO::PIN, BIT>::value, "input must be GPIO::PIN enum");

            if (drv == DRV_STRENGTH::REDUCED) m_drv.clear(bit);
            else
                m_drv.set(bit);
        }
#endif
    };

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *P1SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG, volatile auto *DRVREG>
    struct PortWithIntDrv : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSel0and1<INREG, OUTREG, DIRREG, PRENREG, P0SEL, P1SEL>
      , PortWithDrv<DRVREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *P1SEL, volatile auto *DRVREG>
    struct PortDrv : PortCommon<INREG, OUTREG>
      , PortSel0and1<INREG, OUTREG, DIRREG, PRENREG, P0SEL, P1SEL>
      , PortWithDrv<DRVREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG, volatile auto *DRVREG>
    struct PortWithIntSel0Drv : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSelOnly0<INREG, OUTREG, DIRREG, PRENREG, P0SEL>
      , PortWithDrv<DRVREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *DRVREG>
    struct PortSel0Drv : PortCommon<INREG, OUTREG>
      , PortSelOnly0<INREG, OUTREG, DIRREG, PRENREG, P0SEL>
      , PortWithDrv<DRVREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *DRVREG>
    struct PortSelOffDrv : PortCommon<INREG, OUTREG>
      , PortNoSel<INREG, OUTREG, DIRREG, PRENREG>
      , PortWithDrv<DRVREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *P0SEL, volatile auto *P1SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG, volatile auto *DRVREG>
    struct PortWithIntNoPullDrv : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSel0and1WithoutPull<INREG, OUTREG, DIRREG, P0SEL, P1SEL>
      , PortWithDrv<DRVREG> {};


    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *P1SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG>
    struct PortWithInt : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSel0and1<INREG, OUTREG, DIRREG, PRENREG, P0SEL, P1SEL> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *P1SEL>
    struct Port : PortCommon<INREG, OUTREG>
      , PortSel0and1<INREG, OUTREG, DIRREG, PRENREG, P0SEL, P1SEL> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG>
    struct PortWithIntSel0 : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSelOnly0<INREG, OUTREG, DIRREG, PRENREG, P0SEL> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG, volatile auto *P0SEL>
    struct PortSel0 : PortCommon<INREG, OUTREG>
      , PortSelOnly0<INREG, OUTREG, DIRREG, PRENREG, P0SEL> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *PRENREG>
    struct PortSelOff : PortCommon<INREG, OUTREG>
      , PortNoSel<INREG, OUTREG, DIRREG, PRENREG> {};

    template<volatile auto *INREG, volatile auto *OUTREG, volatile auto *DIRREG, volatile auto *P0SEL, volatile auto *P1SEL, volatile auto *IESREG, volatile auto *IEREG, volatile auto *IFGREG>
    struct PortWithIntNoPull : PortCommon<INREG, OUTREG>
      , PortInt<IESREG, IEREG, IFGREG>
      , PortSel0and1WithoutPull<INREG, OUTREG, DIRREG, P0SEL, P1SEL> {};

}// namespace Internal

#if defined(__MSP430_HAS_PORT1_R__) || defined(__MSP430_HAS_PORT1__)
#if defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1SEL0) && defined(P1SEL1) && defined(P1REN) && defined(P1DS)
using Port1 = Internal::PortWithIntDrv<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1SEL1, &P1IES, &P1IE, &P1IFG, &P1DS>;
#elif defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1SEL0) && defined(P1SEL1) && defined(P1REN)
using Port1  = Internal::PortWithInt<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1SEL1, &P1IES, &P1IE, &P1IFG>;
#elif defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1SEL0) && defined(P1SEL1) && defined(P1DS)
using Port1  = Internal::PortWithIntNoPullDrv<&P1IN, &P1OUT, &P1DIR, &P1SEL0, &P1SEL1, &P1IES, &P1IE, &P1IFG, &P1DS>;
#elif defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1SEL0) && defined(P1SEL1)
using Port1  = Internal::PortWithIntNoPull<&P1IN, &P1OUT, &P1DIR, &P1SEL0, &P1SEL1, &P1IES, &P1IE, &P1IFG>;
#elif defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1REN) && defined(P1DS)
using Port1  = Internal::PortWithIntSel0Drv<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1IES, &P1IE, &P1IFG, &P1DS>;
#elif defined(P1IES) && defined(P1IE) && defined(P1IFG) && defined(P1REN)
using Port1  = Internal::PortWithIntSel0<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1IES, &P1IE, &P1IFG>;
#elif defined(P1SEL0) && defined(P1SEL1) && defined(P1REN) && defined(P1DS)
using Port1  = Internal::PortDrv<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1SEL1, &P1DS>;
#elif defined(P1SEL0) && defined(P1SEL1) && defined(P1REN)
using Port1  = Internal::Port<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1SEL1>;
#elif defined(P1SEL0) && defined(P1REN) && defined(P1DS)
using Port1  = Internal::PortSel0Drv<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0, &P1DS>;
#elif defined(P1SEL0) && defined(P1REN)
using Port1  = Internal::PortSel0<&P1IN, &P1OUT, &P1DIR, &P1REN, &P1SEL0>;
#endif
#endif


